docs: refactor Hub docs structure
